# Spencer Chun

In [165]:
import pandas as pd
import numpy as np
hisp_df = pd.read_excel('https://users.ssc.wisc.edu/~mckelvey/ec390/wi_pop_countylevel_hisp.xlsx', sheet_name = 'Hispanic',header = 3, index_col = 'Unnamed: 0')
non_hisp_df = pd.read_excel('https://users.ssc.wisc.edu/~mckelvey/ec390/wi_pop_countylevel_hisp.xlsx',sheet_name = 'Non-Hispanic', header = 3, index_col = 'Unnamed: 0')
display(hisp_df)
display(non_hisp_df)
population = hisp_df+non_hisp_df
display(population)
proportion_hispanic = hisp_df/population
display(proportion_hispanic)
percentage_hispanic = proportion_hispanic*100
display(percentage_hispanic)
population.sum()

             2020    2021    2022
MILWAUKEE  150471  151387  152466
DANE        37994   38883   40033
RACINE      28472   28986   29653
BROWN       25353   25892   26646
KENOSHA     23641   24073   24512
...           ...     ...     ...
CRAWFORD      290     314     307
FOREST        229     233     239
PEPIN         171     185     192
IRON           97      99     103
FLORENCE       52      57      67

[72 rows x 3 columns]

             2022    2021    2020
ADAMS       20206   19851   19762
ASHLAND     15480   15513   15488
BARRON      45327   45290   45375
BAYFIELD    16199   15890   15825
BROWN      243390  242922  243568
...           ...     ...     ...
WAUKESHA   388137  387682  386664
WAUPACA     49605   50180   50024
WAUSHARA    23349   23188   22960
WINNEBAGO  162657  162608  164072
WOOD        71320   71469   71691

[72 rows x 3 columns]

             2020    2021    2022
ADAMS       20675   20795   21226
ASHLAND     16018   16054   16039
BARRON      46714   46746   46843
BAYFIELD    16233   16304   16608
BROWN      268921  268814  270036
...           ...     ...     ...
WAUKESHA   407467  409080  410434
WAUPACA     51791   51992   51488
WAUSHARA    24549   24797   24999
WINNEBAGO  171800  170554  170718
WOOD        74197   74085   73993

[72 rows x 3 columns]

               2020      2021      2022
ADAMS      0.044160  0.045396  0.048054
ASHLAND    0.033088  0.033699  0.034853
BARRON     0.028664  0.031147  0.032363
BAYFIELD   0.025134  0.025393  0.024627
BROWN      0.094277  0.096319  0.098676
...             ...       ...       ...
WAUKESHA   0.051054  0.052308  0.054325
WAUPACA    0.034118  0.034852  0.036572
WAUSHARA   0.064728  0.064887  0.066003
WINNEBAGO  0.044983  0.046589  0.047218
WOOD       0.033775  0.035311  0.036125

[72 rows x 3 columns]

               2020      2021      2022
ADAMS      4.415961  4.539553  4.805427
ASHLAND    3.308778  3.369877  3.485255
BARRON     2.866378  3.114705  3.236343
BAYFIELD   2.513399  2.539254  2.462669
BROWN      9.427676  9.631939  9.867573
...             ...       ...       ...
WAUKESHA   5.105444  5.230762  5.432542
WAUPACA    3.411790  3.485152  3.657163
WAUSHARA   6.472769  6.488688  6.600264
WINNEBAGO  4.498254  4.658935  4.721822
WOOD       3.377495  3.531079  3.612504

[72 rows x 3 columns]

2020    5896271
2021    5880101
2022    5892539
dtype: int64

In [166]:
university_data = pd.read_excel('https://users.ssc.wisc.edu/~mckelvey/ec390/tabn312.10.xlsx', header = 1, skipfooter = 4, index_col = 'Institution')
display(university_data)
university_data.drop(1, axis = 'rows', inplace = True)
university_data.rename(columns = {'State':'state', 'Rank\\1\\':'rank', 'Control\\2\\':'type', 'Level':'level','Total enrollment':'enrollment_total','Enrollment in exclusively distance education courses':'enrollment_distance'},inplace = True)
university_data['percent_distance'] = 100*(university_data['enrollment_distance'] / university_data['enrollment_total'])
display(university_data)
print("The university with the lowest percentage of students in distance learning programs is {} with a value of {:.1f} percent".format(university_data['percent_distance'].idxmin(), university_data['percent_distance'].min()))
tab = pd.crosstab(university_data['type'],'count')
tab['proportion'] = pd.crosstab(university_data['type'], 'count', normalize = 'columns')
display(tab)
pd.crosstab(university_data['type'], university_data['level'])

,State,Rank\1\,Control\2\,Level,Total enrollment,Enrollment in exclusively distance education courses
Institution,,,,,,
1,2,3,4,5,6,7
Western Governors University,UT,1,PrivNp,4-year,150116,150116
Southern New Hampshire University,NH,2,PrivNp,4-year,145533,138672
Grand Canyon University,AZ,3,PrivFp,4-year,103072,79865
Liberty University,VA,4,PrivNp,4-year,94709,79906
...,...,...,...,...,...,...
University of Pennsylvania,PA,116,PrivNp,4-year,28038,2890
East Carolina University,NC,117,Public,4-year,28021,8218
"Chamberlain University, Illinois",IL,118,PrivFp,4-year,27744,25057
"Indiana University-Purdue University, Indianapolis",IN,119,Public,4-year,27690,3576
"California State University, Los Angeles",CA,120,Public,4-year,27513,8854

,state,rank,type,level,enrollment_total,enrollment_distance,percent_distance
Institution,,,,,,,
Western Governors University,UT,1,PrivNp,4-year,150116,150116,100.000000
Southern New Hampshire University,NH,2,PrivNp,4-year,145533,138672,95.285605
Grand Canyon University,AZ,3,PrivFp,4-year,103072,79865,77.484671
Liberty University,VA,4,PrivNp,4-year,94709,79906,84.370018
The Pennsylvania State University,PA,5,Public,4-year,88914,15680,17.635018
...,...,...,...,...,...,...,...
University of Pennsylvania,PA,116,PrivNp,4-year,28038,2890,10.307440
East Carolina University,NC,117,Public,4-year,28021,8218,29.328004
"Chamberlain University, Illinois",IL,118,PrivFp,4-year,27744,25057,90.315023
"Indiana University-Purdue University, Indianapolis",IN,119,Public,4-year,27690,3576,12.914410
"California State University, Los Angeles",CA,120,Public,4-year,27513,8854,32.181151

The university with the lowest percentage of students in distance learning programs is The University of Texas at Dallas with a value of 0.6 percent

col_0   count  proportion
type
PrivFp      7    0.058333
PrivNp     13    0.108333
Public    100    0.833333

level   2-year  4-year
type
PrivFp       0       7
PrivNp       0      13
Public       6      94